---
kind: type
id: T:Autodesk.Revit.DB.NumberSystem
source: html/5c027e93-1dff-9a6e-8602-5b3a3da60ada.htm
---
# Autodesk.Revit.DB.NumberSystem

An annotation that consists of a series of numeric tags attached to and describing a host element.

## Syntax (C#)
```csharp
public class NumberSystem : Element
```

## Remarks
For a component-based stair, you can display tread/riser numbers for a run in plan, elevation, or section view. Sketch-based stair is not supported.